---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTableIterator.Dispose
source: html/3d01ba8a-bf7a-b89b-573d-6c8113aa17f6.htm
---
# Autodesk.Revit.DB.ExportLayerTableIterator.Dispose Method

Releases all resources used by the ExportLayerTableIterator

## Syntax (C#)
```csharp
public void Dispose()
```